In [56]:
import numpy as np
import pandas as pd

In [57]:
df_sms = pd.read_csv(filepath_or_buffer=".\\dataset\\spam.csv", encoding="ISO-8859-1")

In [58]:
df_sms.head()

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,ham,"Go until jurong point, crazy.. Available only ...",NaN,NaN,NaN
1,ham,Ok lar... Joking wif u oni...,NaN,NaN,NaN
2,spam,Free entry in 2 a wkly comp to win FA Cup fina...,NaN,NaN,NaN
3,ham,U dun say so early hor... U c already then say...,NaN,NaN,NaN
4,ham,"Nah I don't think he goes to usf, he lives aro...",NaN,NaN,NaN

In [59]:
df_sms.shape

(5572, 5)

In [60]:
df_sms.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [61]:
df_sms.describe()

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
count,5572,5572,50,12,6
unique,2,5169,43,10,5
top,ham,"Sorry, I'll call later","bt not his girlfrnd... G o o d n i g h t . . .@""","MK17 92H. 450Ppw 16""","GNT:-)"""
freq,4825,30,3,2,2

In [62]:
df_sms.columns

Index(['v1', 'v2', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4'], dtype='object')

In [63]:
df_sms.drop(columns=['Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4'], inplace=True)

In [64]:
df_sms.sample(5)

       v1                                                 v2
1274  ham  Let me know how to contact you. I've you settl...
1029  ham                         Its good, we'll find a way
2618  ham  Hey pple...$700 or $900 for 5 nights...Excelle...
2378  ham  Hi, Mobile no.  &lt;#&gt;  has added you in th...
3025  ham    I finished my lunch already. U wake up already?

In [65]:
df_sms['v1'].unique()

array(['ham', 'spam'], dtype=object)

In [66]:
df_sms = df_sms.rename(columns={"v1":"type", "v2":"sms"})

In [67]:
df_sms.sample()

  type                                                sms
0  ham  Go until jurong point, crazy.. Available only ...

In [68]:
df_sms.duplicated().sum()

403

In [69]:
df_sms.drop_duplicates(inplace=True)

In [70]:
df_sms.duplicated().sum()

0